mokeMX/dian_git/examples/sensor_hub/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32s3"

# Ultrasonic #1: hardware UART1 on the board's free pin IO35 (RX only).
CONFIG_SENSOR_HUB_A02YYUW_ENABLE=y
CONFIG_SENSOR_HUB_A02YYUW_USE_SW_UART=n
CONFIG_SENSOR_HUB_A02YYUW_UART=1
CONFIG_SENSOR_HUB_A02YYUW_RX_GPIO=35
CONFIG_SENSOR_HUB_A02YYUW_TX_GPIO=-1

# Ultrasonic #2: software (bit-bang) UART on the board's free pin IO36 (RX only).
CONFIG_SENSOR_HUB_A02YYUW2_ENABLE=y
CONFIG_SENSOR_HUB_A02YYUW2_USE_SW_UART=y
CONFIG_SENSOR_HUB_A02YYUW2_RX_GPIO=36
CONFIG_SENSOR_HUB_A02YYUW2_TX_GPIO=-1
